In [7]:
import pandas as pd

In [8]:
purchase_1 = pd.Series({'Name': 'Winfred',
                        'Interest': 'PC Building',
                        'Cost': 1300.99})
purchase_2 = pd.Series({'Name': 'Kevyn',
                        'Interest': 'Kitty Litter',
                        'Cost': 220.40})
purchase_3 = pd.Series({'Name': 'Vinod',
                        'Interest': 'Bird Seed',
                        'Cost': 5.00})
df = pd.DataFrame([purchase_1, purchase_2, purchase_3], index = ['Person 1', 'Person 1', 'Person 3'])
df.head()

             Name      Interest     Cost
Person 1  Winfred   PC Building  1300.99
Person 1    Kevyn  Kitty Litter   220.40
Person 3    Vinod     Bird Seed     5.00

In [9]:
df.loc['Person 1']

             Name      Interest     Cost
Person 1  Winfred   PC Building  1300.99
Person 1    Kevyn  Kitty Litter   220.40

In [11]:
type(df.loc['Person 3'])

pandas.core.series.Series

In [12]:
df['Name']

Person 1    Winfred
Person 1      Kevyn
Person 3      Vinod
Name: Name, dtype: object

In [13]:
df.T #transpose

             Person 1      Person 1   Person 3
Name          Winfred         Kevyn      Vinod
Interest  PC Building  Kitty Litter  Bird Seed
Cost          1300.99         220.4          5